module4/sandwichr/app/controllers/sandwiches_controller.rb

SELECT "sandwiches".* FROM "sandwiches"
---
	def index
	  sandwiches = Sandwich.all

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 99]]
---
	def show
	  sandwich = Sandwich.find_by(id: params[:id])

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "sandwiches" SET "total_calories" = ?, "updated_at" = ? WHERE "sandwiches"."id" = ?  [["total_calories", 5], ["updated_at", "2016-08-12 01:16:55.632711"], ["id", 2]]
---
	def add_ingredient
		sandwich = Sandwich.find_by(id: params[:id])
		ingredient = Ingredient.find_by(id: params[:ingredient_id])

		sandwich.ingredients.push(ingredient)