module4/video-games-tournament/app/controllers/tournament_api_controller.rb

	def index
		tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"

	def create
		tournament = Tournament.create(name: params[:name])
---
INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Super Japan Time"], ["created_at", "2016-08-13 19:45:17.701117"], ["updated_at", "2016-08-13 19:45:17.701117"]]

	def destroy
		tournament = Tournament.find_by(id: params[:id])
		unless tournament
			render json: {error: "Tournament not found"},
			status: 404
			return
		end
		tournament.destroy
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 6]]